' *******************************************************************
' 業務名称　: 互助事業システム
' 機能概要　: 契約情報
'            サービス処理
' 作成日　　: 2024.07.21
' 作成者　　: 宋 峰
' 変更履歴　:
' *******************************************************************

Namespace JBD.GJS.Service.GJ0020
    
    ''' <summary>
    ''' 契約情報
    ''' </summary>
    <DisplayName("契約情報")>
    Public Class Service
        Inherits CmServiceBase

        <DisplayName("ホーム情報を取得する")>
        Public Shared Function Home(req As DaRequestBase) As HomeInfoResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    '検索結果出力用ＳＱＬ作成
                    Dim sql = FrmGJ0020Service.f_Search_SQLHome()

                    'データSelect 
                    Dim ds = FrmService.f_Select_ODP(db, sql)

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------
                    Dim dt = ds.Tables(0)
                    Dim res = Wraper.GetHomeResponse(dt)

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return res

                End Function)

        End Function
    End Class
End Namespace
