<!------------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 閉じるボタン(画面)
 * 　　　　　  共通コンポーネント
 * 作成日　　: 2024.08.08
 * 作成者　　: 李
 * 変更履歴　:
 * ----------------------------------------------------------------->
<template>
  <a-button class="ml-a" type="primary" @click="close">閉じる</a-button>
</template>

<script lang="ts" setup>
import { useTabStore } from '@/store/modules/tab'
//--------------------------------------------------------------------------
//データ定義
//--------------------------------------------------------------------------
const tabStore = useTabStore()
//--------------------------------------------------------------------------
//メソッド
//--------------------------------------------------------------------------
const close = async () => {
  tabStore.removeActiveTab()
}

defineExpose({ close })
</script>
