//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 初期処理 */
export interface InitRequest extends DaRequestBase {
  /** 種別区分 */
  prockbn: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 初期化処理 */
export interface InitResponse extends DaResponseBase {
  /** 【プロシージャリスト */
  procList: DaSelectorKeyModel[]
}
