// *******************************************************************
// 業務名称　: 健康管理システム
// 機能概要　: 取込設定.登録項目設定情報ダイアログ画面
//             リクエストインターフェース
// 作成日　　: 2023.09.08
// 作成者　　: 韋
// 変更履歴　:
// *******************************************************************
namespace BCC.Affect.Service.AWKK00605D
{
    /// <summary>
    /// 初期化処理(取込設定：登録項目設定情報ダイアログ画面)
    /// </summary>
    public class InitRequest : DaRequestBase
    {
        public List<string> pageitemList { get; set; } //画面項目情報の(画面項目ID,項目名)のリスト
    }
}