/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 保健指導詳細検索設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.02.06
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/
import { SaveVM } from '../AWKK00802D/type'
import { SearchVM } from '../AWKK00802D/type'

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 保存処理 */
export interface SaveRequest extends DaRequestBase {
  /** 画面一覧 */
  kekkalist: SaveVM[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 右部分(独自) */
  kekkalist1: SearchVM[]
}
