/** ----------------------------------------------------------------
 * 業務名称　: 互助事業システム
 * 機能概要　: 契約者積立金・互助金単価マスタ
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.10.10
 * 作成者　　: 高弘昆
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------

/**検索処理(一覧画面) */
export interface SearchResponse extends CmSearchResponseBase {
  /**一覧情報 */
  KEKKA_LIST: CmDateFmToModel
}
