/** ----------------------------------------------------------------
 * 業務名称　: 互助事業システム
 * 機能概要　:互助基金契約者マスタ
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.08.27
 * 作成者　　:魏星
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
export interface SearchRequest extends DaRequestBase {
  /**期 */
  KI: number
  /**契約者番号 */
  KEIYAKUSYA_CD: number
}
//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
export interface SearchResponse extends DaRequestBase {
  /**契約羽数合計 */
  HASU_GOKEI: CmKeiGokeiModel
  /**契約農場別明細情報(表示)リスト */
  KEKKA_LIST: SearchRowVM[]
}
//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
export interface SearchRowVM {
  /**自動採番 */
  SEQNO: number
  /**明細番号 */
  MEISAI_NO: number
  /**農場コード */
  NOJO_CD: number
  /**農場名 */
  NOJO_NAME: string
  /**農場住所 */
  NOJO_ADDR: string
  /**鳥の種類コード */
  TORI_KBN: number
  /**鳥の種類名 */
  TORI_KBN_NAME: string
  /**契約羽数 */
  KEIYAKU_HASU: number
  /**備考 */
  BIKO: string
}
