/** ----------------------------------------------------------------
 * 業務名称　: 健康管理システム
 * 機能概要　: 使用履歴
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.03.03
 * 作成者　　: 李
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 保存処理 */
export interface SaveRequest extends DaRequestBase {
  /** 機能ID */
  kinoid: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 使用履歴リスト */
  kekkalist: SiyorirekiVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 使用履歴 */
export interface SiyorirekiVM {
  /** 機能ID */
  kinoid: string
  /** 表示名称 */
  hyojinm: string
  /** 禁止 */
  disabled?: boolean
}
