/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 生活保護受給情報履歴履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.12
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 福祉事務所コード */
  fukusijimusyocd: string
  /** ケース番号 */
  caseno: string
  /** 員番号 */
  inno: number
  /** 決定履歴番号 */
  ketteirirekino: number
  /** 申請履歴番号 */
  sinseirirekino: number
  /** 生活保護開始年月日 */
  seihoymdf: string
  /** 停止年月日 */
  teisiymd: string
  /** 停止解除年月日 */
  teisikaijoymd: string
  /** 廃止年月日 */
  haisiymd: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
