/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 取込設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.09.15
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 初期化処理(取込設定：取込ファイルIF情報ダイアログ画面) */
export interface InitRequest extends DaRequestBase {
  //
}

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 初期化処理(フォーマット) */
export interface InitFormatListRequest extends DaRequestBase {
  /* データ型 */
  datatype: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 初期化処理(取込設定：取込ファイルIF情報ダイアログ画面) */
export interface InitResponse extends DaResponseBase {
  /** 【データ型】のドロップダウンリスト */
  datatypeList: DaSelectorModel[]
  fmtcheckList: DaSelectorModel[]
  fmtchangeList: DaSelectorModel[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 初期化処理(フォーマット) */
export interface InitFormatListResponse extends DaResponseBase {
  //【フォーマット】ドロップダウンリスト
  formatList: DaSelectorModel[]
}