/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 世帯検索
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.12.06
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchRequest extends CmSearchRequestBase {
  /** 世帯主カナ氏名 */
  kname: string
  /** 世帯主氏名 */
  name: string
  /** 世帯郵便番号 */
  adrs_yubin: string
  /** 世帯住所 */
  adrs: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/**  */
export interface SearchResponse extends CmSearchResponseBase {
  /** 世帯情報 */
  kekkalist: SearchVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 世帯情報モデル */
export interface SearchVM {
  /** 世帯番号 */
  setaino: string
  /** 宛名番号 */
  atenano: string
  /** 氏名 */
  name: string
  /** 性別 */
  sex: string
  /** 生年月日 */
  bymd: string
  /** 住民区分 */
  juminkbn: string
  /** 郵便番号 */
  adrs_yubin: string
  /** 住所 */
  adrs: string
}
