/** ----------------------------------------------------------------
 * 業務名称　: 互助事業システム
 * 機能概要　: xxxxxxxxxxxxxxxxxxxxx
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.xx.xx
 * 作成者　　: xxxx
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
export interface InitRequest extends DaRequestBase {
  /** 対象期 */
  KI?: number;
}

/** プレビュー処理_プレビュー画面リクエスト */
export interface PreviewRequest extends DaRequestBase {
  /** 対象期 */
  KI?: number;
  /** 事業対象年度 */
  JIGYO_SYURYO_NENDO?: Date;
  /** 出力区分 */
  SEIKYU_HENKAN_KBN?: number;
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
export interface InitResponse extends DaResponseBase {
  /** 対象期 */
  KI?: number;
  /** 事業対象年度 */
  JIGYO_SYURYO_NENDO?: Date;
}
//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
