/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 身体障害者手帳情報履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.12
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 履歴番号 */
  rirekino: number
  /** 手帳番号 */
  tetyono: string
  /** 返還日 */
  henkanymd: string
  /** 初回交付日 */
  syokaikofuymd: string
  /** 障害種別(名称) */
  syogaisyubetunm: string
  /** 総合等級(名称) */
  sogotokyunm: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
