/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 取込設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.09.15
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/
//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 初期化処理(取込設定：登録項目設定情報ダイアログ画面) */
export interface InitRequest extends DaRequestBase {
  /** 画面項目情報の(画面項目ID,項目名)のリスト */
  pageitemList: string[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 初期化処理(取込設定：登録項目設定情報ダイアログ画面) */
export interface InitResponse extends DaResponseBase {
  /** 【データ元画面項目ID】のドロップダウンリスト */
  pageitemseqList: DaSelectorModel[]
  /** 【処理区分】のドロップダウンリスト */
  syorikbnList: DaSelectorModel[]
}
