/** ----------------------------------------------------------------
 * 業務名称　: 互助事業システム
 * 機能概要　:互助基金契約者マスタ
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.08.27
 * 作成者　　:魏星
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------

export interface ListRowVM {
  /**契約者番号 */
  KEIYAKUSYA_CD: number
  /**契約者名 */
  KEIYAKUSYA_NAME: string
  /**フリガナ */
  KEIYAKUSYA_KANA: string
  /**契約区分 */
  KEIYAKU_KBN: string
  /**契約状況 */
  KEIYAKU_JYOKYO: string
  /**電話番号 */
  ADDR_TEL: string
  /**都道府県 */
  KEN_CD: string
  /**事務委託先 */
  JIMUITAKU_CD1: string
}

export interface DetailRowVM {
  /**明細番号 */
  MEISAI_NO: number
  /**農場名 */
  NOJO_NAME: string
  /**農場住所 */
  NOJO_ADDR: string
  /**鳥の種類 */
  TORISYURUI: string
  /**契約羽数 */
  KEIYAKUHASU: string
  /**備考 */
  BIKO: string
}

export interface NoJoRowVM {
  /**農場コード */
  NOJO_CD: number
  /**農場名 */
  NOJO_NAME: string
  /**住所 */
  ADDR: string
}
