/** ----------------------------------------------------------------
 * 業務名称　: 互助事業システム
 * 機能概要　: 積立金返還金振込データ作成(全銀手順)
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.09.19
 * 作成者　　: 阎格
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------

/**初期化処理(プレビュー画面) */
export interface InitRequest extends DaRequestBase {
  /**対象期 */
  KI: number
}

/**プレビュー処理(プレビュー画面) */
export interface PreviewRequest extends DaRequestBase {
  /** 対象期 */
  KI: number | undefined
  /** 請求・返還回数 */
  SEIKYU_KAISU: number | undefined
  /** 振込予定日 */
  FURIKOMI_YOTEI_DATE: Date | undefined
}
