/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 個人住民税課税情報履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.11
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 課税年度 */
  kazeinendo: number
  /** 課税情報履歴番号 */
  kazeirirekino: number
  /** 課税非課税区分 */
  kazeikbn: string
  /** 指定都市_行政区等(名称) */
  tosi_gyoseikunm: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
