/** ----------------------------------------------------------------
 * 業務名称　: 健康管理システム
 * 機能概要　: 対象サイン
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.02.27
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/
import { Row2VM } from '@/views/affect/SH/AWSH003/AWSH00302G/type'

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchRequest extends DaRequestBase {
  /** 年度 */
  nendo: number
  /** 宛名番号 */
  atenano: string
  /** 日程番号 */
  nitteino: number
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 個人基本情報 */
  headerinfo: CommonBarHeaderBaseVM
  /** 検診状況一覧 */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検診状況情報(1件) */
export interface RowVM extends Row2VM {
  /** 受診拒否理由 */
  kyohiriyu: string
}
