/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: メニュー並び順設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.01.09
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 保存処理 */
export interface SaveRequest extends DaRequestBase {
  /** 画面一覧 */
  kekkalist: SaveVM[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 画面一覧 */
  kekkalist: SearchVM[]
  /** 親メニュー名 */
  oyamenunm: string
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 並び順設定行モデル(表示用) */
export interface SearchVM extends SaveVM {
  /** 機能表示名称 */
  hyojinm: string
}
/** 並び順設定行モデル(保存用) */
export interface SaveVM {
  /** 機能ID */
  kinoid: string
}
