<!------------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 404エラー画面
 * 　　　　　  画面レイアウト・処理
 * 作成日　　: 2023.04.05
 * 作成者　　: 李
 * 変更履歴　:
 * ----------------------------------------------------------------->
<template>
  <a-result
    status="404"
    title="404"
    sub-title="申し訳ございません。指定されたファイルまたはディリクレは存在いたしません。"
  >
    <template #extra>
      <a-button type="primary" @click="toHome">ホーム</a-button>
    </template>
  </a-result>
</template>

<script setup lang="ts">
import { useRouter } from 'vue-router'
//--------------------------------------------------------------------------
//メソッド
//--------------------------------------------------------------------------
const router = useRouter()
const toHome = () => {
  router.push({ path: '/' })
}
</script>
