/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 医療機関検索
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.04.14
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchRequest extends CmSearchRequestBase {
  /** 医療機関名 */
  kikannm: string
  /** 医療機関名カナ */
  kanakikannm: string
  /** パターンNo.(ドロップダウンリストコード)  */
  patternno?: string
  /** 実施事業(複数「,」で連結)  */
  jigyocds?: string
  /** 保険医療機関コード  */
  hokenkikancd?: string
  /** 使用停止sql  */
  hasStopFlg: boolean
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 医療機関 */
  kekkalist: SearchVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 医療機関情報モデル */
export interface SearchVM {
  /** 医療機関コード（自治体独自） */
  kikancd: string
  /** 保険医療機関コード  */
  hokenkikancd: string
  /** 医療機関名 */
  kikannm: string
  /** 医療機関名カナ */
  kanakikannm: string
  /** 住所 */
  adrsfull: string
}
