/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 受診拒否設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.02.07
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 初期化処理 */
export interface InitRequest extends DaRequestBase {
  /** 年度 */
  nendo: number
  /** 宛名番号 */
  atenano: string
}
/** 保存処理 */
export interface SaveRequest extends InitRequest {
  /** 受診拒否理由情報一覧 */
  kekkalist: SaveRowVM[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 初期化処理 */
export interface InitResponse extends DaResponseBase {
  /** 受診拒否理由一覧 */
  selectorlist: DaSelectorModel[]
  /** 受診拒否理由情報一覧 */
  kekkalist: InitRowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 受診拒否理由情報(1行)：表示用 */
export interface InitRowVM extends SaveRowVM {
  /** 成人健（検）診事業名 */
  jigyonm: string
}
/** 受診拒否理由情報(1行)：保存用 */
export interface SaveRowVM {
  /** 成人健（検）診事業コード */
  jigyocd: string
  /** 受診拒否理由(コード：名称) */
  kyohiriyucdnm: string
}
