' *******************************************************************
' 業務名称　: 互助事業システム
' 機能概要　: 契約者一覧表
'            サービス処理
' 作成日　　: 2024.07.21
' 作成者　　: 宋 峰
' 変更履歴　:
' *******************************************************************

Namespace JBD.GJS.Service.GJ1030

    ''' <summary>
    ''' 契約者一覧表
    ''' </summary>
    <DisplayName("契約者一覧表")>
    Public Class Service
        Inherits CmServiceBase

        <DisplayName("初期化処理_プレビュー画面")>
        Public Shared Function Init(req As InitRequest) As InitResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    'データ結果判定
                    Dim wKbn As String = "K"
                    If req.KI = -1 Then
                        req.KI = CInt(New Obj_TM_SYORI_NENDO_KI().pKI)
                        wKbn = "C"
                    End If

                    'データクエリ
                    Dim ret = FrmGJ1030Service.f_ComboBox_Set(wKbn, req.KI)

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return ret

                End Function)

        End Function

        <DisplayName("プレビュー処理_プレビュー画面")>
        Public Shared Function Preview(req As PreviewRequest) As CmPreviewResponseBase
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    '検索結果出力用ＳＱＬ作成
                    Dim sql = FrmGJ1030Service.f_make_SQL(req)

                    'データSelect 
                    Dim rn As String = "家畜防疫互助基金契約者一覧表(連絡用)"
                    Dim ds = FrmService.f_Select_ODP(db, sql, rn)

                    'データ結果判定
                    Dim dt = ds.Tables(0)
                    If dt.Rows.Count > 0 Then
                        Return New CmPreviewResponseBase
                    Else
                        Return New CmPreviewResponseBase(EnumServiceResult.ServiceAlert2, "該当データが存在しませんでした。")
                    End If

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------

                End Function)

        End Function

    End Class
End Namespace
