' *******************************************************************
' 業務名称　: 互助防疫システム
' 機能概要　: 契約者一覧表
'            サービス処理
' 作成日　　: 2024.07.21
' 作成者　　: 宋
' 変更履歴　:
' *******************************************************************

Namespace JBD.GJS.Service.GJ1030

    ''' <summary>
    ''' 契約者一覧表
    ''' </summary>
    <DisplayName("契約者一覧表")>
    Public Class Service
        Inherits CmServiceBase

        <DisplayName("初期化処理_プレビュー画面")>
        Public Shared Function Init(req As InitRequest) As InitResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------
                    'チェックトークン
                    Dim uid = CheckToken(req.token)
                    If String.IsNullOrEmpty(uid) Then Return New InitResponse("トークンが正しくありません。")

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    'データ結果判定
                    Dim wKbn As String = "K"
                    If req.KI = -1 Then
                        req.KI = Cint(New Obj_TM_SYORI_NENDO_KI().pKI)
                        wKbn = "C"
                    End If

                    'データクエリ
                    Dim ret = f_ComboBox_Set(wKbn,req.KI)

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return ret

                End Function)

        End Function

        <DisplayName("プレビュー処理_プレビュー画面")>
        Public Shared Function Preview(req As PreviewRequest) As SearchResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------
                    'チェックトークン
                    'Dim uid = CheckToken(req.token)
                    'If String.IsNullOrEmpty(uid) Then Return New SearchResponse("トークンが正しくありません。")

                    ''-------------------------------------------------------------
                    ''4.ビジネスロジック処理
                    ''-------------------------------------------------------------
                    ''検索結果出力用ＳＱＬ作成
                    'Dim sql = f_Search_SQLMake(req)

                    ''元の SQL をページ分割されたデータ出力に変換する
                    'Dim psql = f_Search_SQLMakePage(req.PAGE_SIZE, req.PAGE_NUM, sql)

                    ''データSelect 
                    'Dim ds = f_Select_ODP(db, psql)
                    'Dim dt = ds.Tables(0)

                    ''-------------------------------------------------------------
                    ''5.データ加工処理
                    ''-------------------------------------------------------------
                    'Dim res = Wraper.SearchResponse(dt)
                    'res.KI = req.KI
                    'res.KEIYAKUSYA_CD = req.KEIYAKUSYA_CD

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return New SearchResponse

                End Function)

        End Function

    End Class
End Namespace
