/** ----------------------------------------------------------------
 * 業務名称　: 健康管理システム
 * 機能概要　: 警告情報照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.09.25
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchRequest extends DaRequestBase {
  /** 宛名番号 */
  atenano: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 警告情報一覧 */
  kekkalist: SearchVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 警告情報(1件) */
export interface SearchVM {
  /** 履歴番号 */
  rirekino: number
  /** 支援措置開始年月日 */
  siensotiymdf: string
  /** 支援措置終了年月日 */
  siensotiymdt: string
  /** 支援措置区分 */
  siensotikbn: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
