/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 住民情報履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.11
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchRequest extends CmSearchRequestBase {
  /** 宛名番号 */
  atenano: string
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 履歴番号 */
  rirekino: number
  /** 氏名 */
  name: string
  /** 住民区分 */
  juminjotai: string
  /** 異動年月日 */
  idoymd: string
  /** 異動事由 */
  idojiyu: string
  /** 住所(住所_町字、住所_番地号表記、住所_方書) */
  adrs: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisin: string
}
