/** ----------------------------------------------------------------
 * 業務名称　: 健康管理システム
 * 機能概要　: 保健指導・集団指導項目並び順設定
 * 　　　　　  インターフェース定義
 * 作成日　　: 2024.01.24
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/
import { SidoCommonHeaderVM, SidoCommonRequest } from '../AWKK00801G/type'
import { SearchVM, SaveVM } from '../AWKK00805D/type'

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 保存処理 */
export interface SaveRequest extends SidoCommonRequest {
  /** 項目一覧 */
  kekkalist: SaveVM[]
}

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends DaResponseBase {
  /** 指導項目一覧画面ヘッダー情報 */
  headerinfo: SidoCommonHeaderVM
  /** 項目一覧 */
  kekkalist: SearchVM[]
}
