' *******************************************************************
' 業務名称　: 互助事業システム
' 機能概要　: 互助基金契約者マスタ一覧
'             サービス処理
' 作成日　　: 2024.07.21
' 作成者　　: 宋 峰
' 変更履歴　:
' *******************************************************************

Namespace JBD.GJS.Service.GJ1010

    ''' <summary>
    ''' 初期化処理_一覧画面
    ''' </summary>
    <DisplayName("初期化処理_一覧画面")>
    Public Class Service
        Inherits CmServiceBase

        <DisplayName("初期化処理_一覧画面処理")>
        Public Shared Function Init(req As InitRequest) As InitResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    'データ結果判定
                    Dim wKbn As String = "K"
                    If req.KI = -1 Then
                        req.KI = CInt(New Obj_TM_SYORI_NENDO_KI().pKI)
                        wKbn = "C"
                    End If

                    'データクエリ

                    Dim dt1 = f_CodeMaster_Data_Select(5, 0)
                    Dim dt2 = f_CodeMaster_Data_Select(1, 0)
                    Dim dt3 = f_CodeMaster_Data_Select(2, 1)

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------
                    Dim res = Wraper.GetInitResponse(wKbn, req, dt1, dt2, dt3)
                    res.KI = req.KI

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return res

                End Function)

        End Function

        <DisplayName("検索処理_一覧画面処理")>
        Public Shared Function Search(req As SearchRequest) As SearchResponse
            Return Nolock(req,
                Function(db)

                    '-------------------------------------------------------------
                    '1.初期化
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '2.データ取得
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '3.チェック処理
                    '-------------------------------------------------------------

                    '-------------------------------------------------------------
                    '4.ビジネスロジック処理
                    '-------------------------------------------------------------
                    '検索結果出力用ＳＱＬ作成
                    Dim sql = FrmGJ1010Service.f_Search_SQLMake(req)

                    '元の SQL をページ分割されたデータ出力に変換する
                    Dim psql = FrmGJ1010Service.f_Search_SQLMakePage(req.PAGE_SIZE, req.PAGE_NUM, sql)

                    'データSelect 
                    Dim ds = FrmService.f_Select_ODP(db, psql)

                    '-------------------------------------------------------------
                    '5.データ加工処理
                    '-------------------------------------------------------------
                    Dim dt = ds.Tables(0)
                    If dt.Rows.Count = 0 Then
                        Return New SearchResponse(EnumServiceResult.ServiceAlert2, "指定された条件に一致するデータは存在しません。")
                    End If
                    Dim res = Wraper.SearchResponse(dt)
                    res.KI = req.KI

                    '-------------------------------------------------------------
                    '6.正常返し
                    '-------------------------------------------------------------
                    Return res

                End Function)

        End Function
    End Class
End Namespace
