/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 後期被保険者情報履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.12
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 履歴番号 */
  rirekino: number
  /** 被保険者番号 */
  hihokensyano: string
  /** 被保険者資格取得年月日 */
  hiho_sikakusyutokuymd: string
  /** 被保険者資格喪失年月日 */
  hiho_sikakusosituymd: string
  /** 被保険者資格取得事由(名称) */
  hiho_sikakusyutokujiyunm: string
  /** 被保険者資格喪失事由(名称) */
  hiho_sikakusositujiyunm: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
