/** ----------------------------------------------------------------
 * 業務名称　: 健康管理システム
 * 機能概要　: パスワード変更
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.05.15
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//リクエスト
//-------------------------------------------------------------------
/** 保存処理 */
export interface SaveRequest extends CmSaveRequestBase {
  /** 旧パスワード */
  oldpword: string
  /** 新パスワード */
  newpword: string
}

//-------------------------------------------------------------------
//画面項目
//-------------------------------------------------------------------
export interface PasswordFormState {
  /**ユーザーID */
  userid: string
  /** 旧パスワード */
  oldpword: string
  /** 新パスワード */
  newpword: string
  /** 新パスワード(確認) */
  checkpword: string
}
