// *******************************************************************
// 業務名称　: 健康管理システム
// 機能概要　: 登録部署設定
//             リクエストインターフェース
// 作成日　　: 2023.07.04
// 作成者　　: 蔣
// 変更履歴　:
// *******************************************************************
namespace BCC.Affect.Service.AWAF00902D
{
    /// <summary>
    /// 検索処理
    /// </summary>
    public class SearchRequest : DaRequestBase
    {
        public Enum名称区分 kbn1 { get; set; } = Enum名称区分.名称;  //名称区分(メインコード)
        public Enum名称区分 kbn2 { get; set; } = Enum名称区分.名称;  //名称区分(サブコード)
    }
}