/** ----------------------------------------------------------------
 * 業務名称　: 養鶏-互助防疫システム
 * 機能概要　: 納税義務者情報履歴照会
 * 　　　　　  インターフェース定義
 * 作成日　　: 2023.10.11
 * 作成者　　: 屠
 * 変更履歴　:
 * -----------------------------------------------------------------*/

//-------------------------------------------------------------------
//レスポンス
//-------------------------------------------------------------------
/** 検索処理 */
export interface SearchResponse extends CmSearchResponseBase {
  /** 結果リスト(履歴一覧) */
  kekkalist: RowVM[]
}

//-------------------------------------------------------------------
//ビューモデル
//-------------------------------------------------------------------
/** 検索処理 */
export interface RowVM {
  /** 履歴No. */
  rirekinum: number
  /** 課税年度 */
  kazeinendo: number
  /** 個人履歴番号 */
  kojinrirekino: number
  /** 未申告区分 */
  misinkokukbn: string
  /** 他団体課税対象者区分 */
  takazeikbn: string
  /** 他団体課税対象者の課税先市区町村(名称) */
  takazeisikunm: string
  /** 指定都市_行政区等(名称) */
  tosi_gyoseikunm: string
  /** 更新日時 */
  upddttm: string
  /** 最新フラグ */
  saisinflg: string
}
